In [1]:
!rm -f Chinook.zip
!rm -f *.csv

zsh:1: no matches found: *.csv

In [9]:
import sys
print(sys.executable)

/Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/bin/python

In [12]:
import sys
py = sys.executable
!"{py}" -m pip install --upgrade pip
!"{py}" -m pip install pandas sqlalchemy mysql-connector-python nbformat nbconvert

Requirement already satisfied: pip in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (25.2)
Collecting pip
  Using cached pip-25.3-py3-none-any.whl.metadata (4.7 kB)
Using cached pip-25.3-py3-none-any.whl (1.8 MB)
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 25.2
    Uninstalling pip-25.2:
      Successfully uninstalled pip-25.2
Successfully installed pip-25.3
Collecting pandas
  Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (91 kB)
Collecting sqlalchemy
  Using cached sqlalchemy-2.0.45-py3-none-any.whl.metadata (9.5 kB)
Collecting mysql-connector-python
  Using cached mysql_connector_python-9.5.0-cp313-cp313-macosx_14_0_arm64.whl.metadata (7.5 kB)
Requirement already satisfied: nbformat in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (5.10.4)
Requirement already satisfied: nbconvert in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (7.16.6)
Requirement already satisfied: numpy>=1.26.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from sqlalchemy) (4.14.1)
Requirement already satisfied: fastjsonschema>=2.15 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbformat) (2.21.1)
Requirement already satisfied: jsonschema>=2.6 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbformat) (4.25.0)
Requirement already satisfied: jupyter-core!=5.0.*,>=4.12 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbformat) (5.8.1)
Requirement already satisfied: traitlets>=5.1 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbformat) (5.14.3)
Requirement already satisfied: beautifulsoup4 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (4.13.4)
Requirement already satisfied: bleach!=5.0.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from bleach[css]!=5.0.0->nbconvert) (6.2.0)
Requirement already satisfied: defusedxml in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (0.7.1)
Requirement already satisfied: jinja2>=3.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (3.1.6)
Requirement already satisfied: jupyterlab-pygments in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (0.3.0)
Requirement already satisfied: markupsafe>=2.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (3.0.2)
Requirement already satisfied: mistune<4,>=2.0.3 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (3.1.3)
Requirement already satisfied: nbclient>=0.5.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (0.10.2)
Requirement already satisfied: packaging in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (25.0)
Requirement already satisfied: pandocfilters>=1.4.1 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (1.5.1)
Requirement already satisfied: pygments>=2.4.1 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbconvert) (2.19.2)
Requirement already satisfied: webencodings in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from bleach!=5.0.0->bleach[css]!=5.0.0->nbconvert) (0.5.1)
Requirement already satisfied: tinycss2<1.5,>=1.1.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from bleach[css]!=5.0.0->nbconvert) (1.4.0)
Requirement already satisfied: attrs>=22.2.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jsonschema>=2.6->nbformat) (25.3.0)
Requirement already satisfied: jsonschema-specifications>=2023.03.6 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jsonschema>=2.6->nbformat) (2025.4.1)
Requirement already satisfied: referencing>=0.28.4 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jsonschema>=2.6->nbformat) (0.36.2)
Requirement already satisfied: rpds-py>=0.7.1 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jsonschema>=2.6->nbformat) (0.26.0)
Requirement already satisfied: platformdirs>=2.5 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jupyter-core!=5.0.*,>=4.12->nbformat) (4.3.8)
Requirement already satisfied: jupyter-client>=6.1.12 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from nbclient>=0.5.0->nbconvert) (8.6.3)
Requirement already satisfied: pyzmq>=23.0 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jupyter-client>=6.1.12->nbclient>=0.5.0->nbconvert) (27.0.0)
Requirement already satisfied: tornado>=6.2 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from jupyter-client>=6.1.12->nbclient>=0.5.0->nbconvert) (6.5.1)
Requirement already satisfied: six>=1.5 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: soupsieve>1.2 in /Users/saifyfairozkhan/Documents/Summer 2025/freeCodeCamp_LLMs/venv/lib/python3.13/site-packages (from beautifulsoup4->nbconvert) (2.7)
Using cached pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl (10.7 MB)
Using cached sqlalchemy-2.0.45-py3-none-any.whl (1.9 MB)
Using cached mysql_connector_python-9.5.0-cp313-cp313-macosx_14_0_arm64.whl (17.6 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: pytz, tzdata, sqlalchemy, mysql-connector-python, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 5/5 [pandas]━━━━ 4/5 [pandas]onnector-python]
Successfully installed mysql-connector-python-9.5.0 pandas-2.3.3 pytz-2025.2 sqlalchemy-2.0.45 tzdata-2025.3

In [13]:
ls

Album.csv          Chinook.zip        Invoice.csv        Playlist.csv
answers.zip        Customer.csv       InvoiceLine.csv    PlaylistTrack.csv
Artist.csv         Employee.csv       MediaType.csv      README.md
autograder.py      Genre.csv          p1.ipynb           Track.csv

In [14]:
!wget -O Chinook.zip https://github.com/CS639-Data-Management-for-Data-Science/s25/raw/main/p1/Chinook.zip
!unzip -o Chinook.zip
!ls -la

--2026-01-03 22:22:04--  https://github.com/CS639-Data-Management-for-Data-Science/s25/raw/main/p1/Chinook.zip
Resolving github.com (github.com)... 20.207.73.82
Connecting to github.com (github.com)|20.207.73.82|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/CS639-Data-Management-for-Data-Science/s25/main/p1/Chinook.zip [following]
--2026-01-03 22:22:04--  https://raw.githubusercontent.com/CS639-Data-Management-for-Data-Science/s25/main/p1/Chinook.zip
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.109.133, 185.199.110.133, 185.199.108.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.109.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 146381 (143K) [application/zip]
Saving to: ‘Chinook.zip’

Chinook.zip         100%[===================>] 142.95K  --.-KB/s    in 0.1s

2026-01-03 22:22:05 (1.21 MB/s) - ‘Chinook.zip’ saved [146381/146381]

Archive:  Chinook.zip
  inflating: Album.csv
  inflating: Artist.csv
  inflating: Customer.csv
  inflating: Employee.csv
  inflating: Genre.csv
  inflating: Invoice.csv
  inflating: InvoiceLine.csv
  inflating: MediaType.csv
  inflating: Playlist.csv
  inflating: PlaylistTrack.csv
  inflating: Track.csv
total 1560
drwxr-xr-x@ 20 saifyfairozkhan  staff     640 Jan  3 22:22 .
drwxr-xr-x@  4 saifyfairozkhan  staff     128 Jan  3 20:15 ..
drwxr-xr-x@  3 saifyfairozkhan  staff      96 Jan  3 22:10 .ipynb_checkpoints
drwxr-xr-x@  9 saifyfairozkhan  staff     288 Jan  3 22:09 .venv
-rw-r--r--@  1 saifyfairozkhan  staff   10816 Sep 19  2024 Album.csv
-rw-r--r--@  1 saifyfairozkhan  staff  127504 Jan  3 20:15 answers.zip
-rw-r--r--@  1 saifyfairozkhan  staff    7016 Sep 19  2024 Artist.csv
-rw-r--r--@  1 saifyfairozkhan  staff    6193 Jan  3 20:15 autograder.py
-rw-r--r--@  1 saifyfairozkhan  staff  146381 Jan  3 22:22 Chinook.zip
-rw-r--r--@  1 saifyfairozkhan  staff    6737 Sep 19  2024 Customer.csv
-rw-r--r--@  1 saifyfairozkhan  staff    1392 Sep 19  2024 Employee.csv
-rw-r--r--@  1 saifyfairozkhan  staff     328 Sep 19  2024 Genre.csv
-rw-r--r--@  1 saifyfairozkhan  staff   27882 Sep 19  2024 Invoice.csv
-rw-r--r--@  1 saifyfairozkhan  staff   44673 Sep 19  2024 InvoiceLine.csv
-rw-r--r--@  1 saifyfairozkhan  staff     136 Sep 19  2024 MediaType.csv
-rw-r--r--@  1 saifyfairozkhan  staff   11892 Jan  3 22:20 p1.ipynb
-rw-r--r--@  1 saifyfairozkhan  staff     298 Sep 19  2024 Playlist.csv
-rw-r--r--@  1 saifyfairozkhan  staff   58707 Sep 19  2024 PlaylistTrack.csv
-rw-r--r--@  1 saifyfairozkhan  staff   20808 Jan  3 20:15 README.md
-rw-r--r--@  1 saifyfairozkhan  staff  241798 Sep 19  2024 Track.csv

In [15]:
import os
import pandas as pd
import pickle
from sqlalchemy import create_engine, text

In [16]:
engine = create_engine("mysql+mysqlconnector://root:123456@127.0.0.1:3306/Chinook")
conn = engine.connect()

In [17]:
csvs = [f for f in os.listdir(".") if f.endswith(".csv")]

for f in csvs:
    table = f.replace(".csv", "")   # table name must match the csv file name
    df = pd.read_csv(f)
    df.to_sql(table, con=engine, if_exists="replace", index=False)

print("Loaded tables:", len(csvs))

Loaded tables: 11

In [20]:
#q1
sql = """
SELECT *
FROM Artist
WHERE Name = 'Queen';
"""
q1_df = pd.read_sql(sql, conn)
q1_df.to_pickle("q1.pkl")
q1_df

   ArtistId   Name
0        51  Queen

In [21]:
#q2
sql = """
SELECT *
FROM Album
WHERE ArtistId = (
    SELECT ArtistId
    FROM Artist
    WHERE Name = 'Queen'
);
"""
q2_df = pd.read_sql(sql, conn)
q2_df.to_pickle("q2.pkl")
q2_df.head()

   AlbumId              Title  ArtistId
0       36   Greatest Hits II        51
1      185    Greatest Hits I        51
2      186  News Of The World        51

In [22]:
#q3
sql = """
SELECT *
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (
        SELECT ArtistId
        FROM Artist
        WHERE Name = 'Queen'
    )
);
"""
q3_df = pd.read_sql(sql, conn)
q3_df.to_pickle("q3.pkl")
q3_df.head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,419,A Kind Of Magic,36,1,1,Roger Taylor,262608,8689618,0.99
1,420,Under Pressure,36,1,1,Queen & David Bowie,236617,7739042,0.99
2,421,Radio GA GA,36,1,1,Roger Taylor,343745,11358573,0.99
3,422,I Want It All,36,1,1,Queen,241684,7876564,0.99
4,423,I Want To Break Free,36,1,1,John Deacon,259108,8552861,0.99

In [23]:
q3_df.shape

(45, 9)

In [24]:
q3_df[["TrackId","Name","Composer","Milliseconds","Bytes"]].head()

   TrackId                  Name             Composer  Milliseconds     Bytes
0      419       A Kind Of Magic         Roger Taylor        262608   8689618
1      420        Under Pressure  Queen & David Bowie        236617   7739042
2      421           Radio GA GA         Roger Taylor        343745  11358573
3      422         I Want It All                Queen        241684   7876564
4      423  I Want To Break Free          John Deacon        259108   8552861

In [27]:
#q4
sql = """
SELECT COUNT(*) AS TotalQueenTracks
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
AND Composer LIKE '%Queen%';
"""
q4_df = pd.read_sql(sql, conn)
q4_df.to_pickle("q4.pkl")
q4_df

   TotalQueenTracks
0                10

In [28]:
#q5
sql = """
SELECT DISTINCT Composer
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
AND Composer IS NOT NULL
ORDER BY Composer;
"""
q5_df = pd.read_sql(sql, conn)
q5_df.to_pickle("q5.pkl")
q5_df.head(20)

                         Composer
0                       Brian May
1                          Deacon
2                    Deacon, John
3         Deacon, John/May, Brian
4                 Freddie Mercury
5   Freddie Mercury & John Deacon
6                     John Deacon
7                             May
8                      May, Brian
9                         Mercury
10               Mercury, Freddie
11                          Queen
12            Queen & David Bowie
13                   Roger Taylor
14                         Taylor

In [29]:
#q6
sql = """
SELECT *
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
ORDER BY Milliseconds DESC
LIMIT 5;
"""
q6_df = pd.read_sql(sql, conn)
q6_df.to_pickle("q6.pkl")
q6_df[["TrackId","Name","Milliseconds","Bytes"]]

   TrackId                       Name  Milliseconds     Bytes
0      424                   Innuendo        387761  12664591
1     2280                  It's Late        386194  12519388
2     2254          Bohemian Rhapsody        358948  11619868
3      421                Radio GA GA        343745  11358573
4      427  Who Wants To Live Forever        297691   9577577

In [30]:
#q7
sql = """
SELECT *
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
AND Bytes < 6000000
ORDER BY Bytes ASC;
"""
q7_df = pd.read_sql(sql, conn)
q7_df.to_pickle("q7.pkl")
q7_df[["TrackId","Name","Bytes"]].head()

   TrackId                            Name    Bytes
0     2271                We Will Rock You  4026815
1     2269                We Will Rock You  4026955
2     2262  Crazy Little Thing Called Love  5435501
3     2267                           Flash  5464986
4     2268              Seven Seas Of Rhye  5539957

In [31]:
#q8
sql = """
SELECT
    Name,
    (Milliseconds / 60000.0) AS DurationMinutes,
    (Bytes / 1000000.0) AS `FileSize in MB`
FROM Track
WHERE AlbumId IN (
    SELECT AlbumId
    FROM Album
    WHERE ArtistId = (SELECT ArtistId FROM Artist WHERE Name = 'Queen')
)
ORDER BY Name;
"""
q8_df = pd.read_sql(sql, conn)
q8_df.to_pickle("q8.pkl")
q8_df.head()

                         Name  DurationMinutes  FileSize in MB
0             A Kind Of Magic           4.3768          8.6896
1          All Dead, All Dead           3.1687          6.1449
2  Another One Bites The Dust           3.6158          7.1724
3                Bicycle Race           3.0637          6.0124
4           Bohemian Rhapsody           5.9825         11.6199

In [32]:
import os
[os.path.exists(f"q{i}.pkl") for i in range(1,9)]

[True, True, True, True, True, True, True, True]

In [33]:
#q9
sql = """
SELECT CustomerId, FirstName, LastName, State
FROM Customer
WHERE Country = 'USA'
ORDER BY State ASC;
"""
q9_df = pd.read_sql(sql, conn)
q9_df.to_pickle("q9.pkl")
q9_df.head()

   CustomerId FirstName LastName State
0          27   Patrick     Gray    AZ
1          16     Frank   Harris    CA
2          19       Tim    Goyer    CA
3          20       Dan   Miller    CA
4          22   Heather  Leacock    FL

In [34]:
#q10
sql = """
SELECT *
FROM Invoice
WHERE Total > 20
ORDER BY Total DESC, InvoiceId ASC;
"""
q10_df = pd.read_sql(sql, conn)
q10_df.to_pickle("q10.pkl")
q10_df.head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,404,6,2025-11-13,Rilská 3174/6,Prague,None,Czech Republic,14300,25.86
1,299,26,2024-08-05,2211 W Berry Street,Fort Worth,TX,USA,76110,23.86
2,96,45,2022-02-18,Erzsébet krt. 58.,Budapest,None,Hungary,H-1073,21.86
3,194,46,2023-04-28,3 Chatham Street,Dublin,Dublin,Ireland,None,21.86

In [35]:
#q11
sql = """
SELECT *
FROM Invoice
WHERE YEAR(InvoiceDate) = 2021
ORDER BY InvoiceDate ASC, InvoiceId ASC;
"""
q11_df = pd.read_sql(sql, conn)
q11_df.to_pickle("q11.pkl")
q11_df.head()

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2021-01-01,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98
1,2,4,2021-01-02,Ullevålsveien 14,Oslo,None,Norway,0171,3.96
2,3,8,2021-01-03,Grétrystraat 63,Brussels,None,Belgium,1000,5.94
3,4,14,2021-01-06,8210 111 ST NW,Edmonton,AB,Canada,T6G 2C7,8.91
4,5,23,2021-01-11,69 Salem Street,Boston,MA,USA,2113,13.86

In [36]:
#q12
sql = """
SELECT SUM(Total) AS TotalExpenditure
FROM Invoice
WHERE CustomerId = (
    SELECT CustomerId
    FROM Customer
    WHERE FirstName = 'Eduardo' AND LastName = 'Martins'
);
"""
q12_df = pd.read_sql(sql, conn)
q12_df.to_pickle("q12.pkl")
q12_df

   TotalExpenditure
0             37.62

In [37]:
#q13
sql = """
SELECT *
FROM Customer
WHERE Country = 'USA'
  AND (Company IS NULL OR Company = '')
ORDER BY CustomerId ASC;
"""
q13_df = pd.read_sql(sql, conn)
q13_df.to_pickle("q13.pkl")
q13_df.head()

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,18,Michelle,Brooks,None,627 Broadway,New York,NY,USA,10012-2612,+1 (212) 221-3546,+1 (212) 221-4679,michelleb@aol.com,3
1,20,Dan,Miller,None,541 Del Medio Avenue,Mountain View,CA,USA,94040-111,+1 (650) 644-3358,None,dmiller@comcast.com,4
2,21,Kathy,Chase,None,801 W 4th Street,Reno,NV,USA,89503,+1 (775) 223-7665,None,kachase@hotmail.com,5
3,22,Heather,Leacock,None,120 S Orange Ave,Orlando,FL,USA,32801,+1 (407) 999-7788,None,hleacock@gmail.com,4
4,23,John,Gordon,None,69 Salem Street,Boston,MA,USA,2113,+1 (617) 522-1333,None,johngordon22@yahoo.com,4

In [38]:
#q14
sql = """
SELECT *
FROM Employee
WHERE Country = 'Canada'
ORDER BY EmployeeId ASC;
"""
q14_df = pd.read_sql(sql, conn)
q14_df.to_pickle("q14.pkl")
q14_df

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18,2002-08-14,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08,2002-05-01,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29,2002-04-01,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19,2003-05-03,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03,2003-10-17,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01,2003-10-17,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,1970-05-29,2004-01-02,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,1968-01-09,2004-03-04,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

In [39]:
import os
missing = [i for i in range(1, 15) if not os.path.exists(f"q{i}.pkl")]
missing

[]

In [ ]:
SELECT t.TrackId
FROM Track t
JOIN Album al ON t.AlbumId = al.AlbumId
JOIN Artist ar ON al.ArtistId = ar.ArtistId
WHERE ar.Name = 'Queen'

In [41]:
#q15
sql = """
SELECT
  c.FirstName,
  c.LastName,
  i.Total
FROM Customer c
JOIN Invoice i ON i.CustomerId = c.CustomerId
ORDER BY c.LastName ASC, i.Total ASC;
"""
q15_df = pd.read_sql(sql, conn)
q15_df.to_pickle("q15.pkl")
q15_df.head()

  FirstName LastName  Total
0   Roberto  Almeida   0.99
1   Roberto  Almeida   1.98
2   Roberto  Almeida   1.98
3   Roberto  Almeida   3.96
4   Roberto  Almeida   5.94

In [42]:
#q16
sql = """
SELECT DISTINCT
  c.CustomerId, c.FirstName, c.LastName
FROM Customer c
JOIN Invoice i ON i.CustomerId = c.CustomerId
JOIN InvoiceLine il ON il.InvoiceId = i.InvoiceId
JOIN Track t ON t.TrackId = il.TrackId
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
WHERE ar.Name = 'Queen'
ORDER BY c.CustomerId ASC;
"""
q16_df = pd.read_sql(sql, conn)
q16_df.to_pickle("q16.pkl")
q16_df.head()

   CustomerId  FirstName LastName
0           2     Leonie   Köhler
1          11  Alexandre    Rocha
2          24      Frank  Ralston
3          27    Patrick     Gray
4          29     Robert    Brown

In [43]:
#q17
sql = """
SELECT DISTINCT
  i.InvoiceId, i.InvoiceDate, i.BillingCountry, i.Total
FROM Invoice i
JOIN InvoiceLine il ON il.InvoiceId = i.InvoiceId
JOIN Track t ON t.TrackId = il.TrackId
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
WHERE ar.Name = 'Queen'
ORDER BY i.InvoiceId ASC;
"""
q17_df = pd.read_sql(sql, conn)
q17_df.to_pickle("q17.pkl")
q17_df.head()

   InvoiceId InvoiceDate BillingCountry  Total
0         12  2021-02-11        Germany  13.86
1         68  2021-10-17         Brazil  13.86
2        117  2022-05-22         France  13.86
3        173  2023-01-25          Spain  13.86
4        225  2023-09-20        Germany   1.98

In [44]:
#q18
sql = """
SELECT
  t.TrackId,
  t.Name AS TrackName,
  al.Title AS AlbumTitle,
  mt.Name AS MediaTypeName
FROM Track t
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
JOIN MediaType mt ON mt.MediaTypeId = t.MediaTypeId
WHERE ar.Name = 'Queen'
ORDER BY t.TrackId ASC;
"""
q18_df = pd.read_sql(sql, conn)
q18_df.to_pickle("q18.pkl")
q18_df.head()

   TrackId             TrackName        AlbumTitle    MediaTypeName
0      419       A Kind Of Magic  Greatest Hits II  MPEG audio file
1      420        Under Pressure  Greatest Hits II  MPEG audio file
2      421           Radio GA GA  Greatest Hits II  MPEG audio file
3      422         I Want It All  Greatest Hits II  MPEG audio file
4      423  I Want To Break Free  Greatest Hits II  MPEG audio file

In [45]:
#q19
sql = """
SELECT
  t.TrackId,
  t.Name AS TrackName,
  g.Name AS GenreName
FROM Track t
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
JOIN Genre g ON g.GenreId = t.GenreId
WHERE ar.Name = 'Queen'
ORDER BY t.TrackId ASC;
"""
q19_df = pd.read_sql(sql, conn)
q19_df.to_pickle("q19.pkl")
q19_df.head()

   TrackId             TrackName GenreName
0      419       A Kind Of Magic      Rock
1      420        Under Pressure      Rock
2      421           Radio GA GA      Rock
3      422         I Want It All      Rock
4      423  I Want To Break Free      Rock

In [46]:
#q20
sql = """
SELECT DISTINCT
  i.InvoiceId,
  i.InvoiceDate,
  i.BillingCity,
  i.BillingState,
  i.CustomerId
FROM Invoice i
JOIN Customer c ON c.CustomerId = i.CustomerId
JOIN InvoiceLine il ON il.InvoiceId = i.InvoiceId
JOIN Track t ON t.TrackId = il.TrackId
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
WHERE c.Country = 'USA'
  AND ar.Name = 'Queen'
ORDER BY i.InvoiceId ASC;
"""
q20_df = pd.read_sql(sql, conn)
q20_df.to_pickle("q20.pkl")
q20_df.head()

   InvoiceId InvoiceDate BillingCity BillingState  CustomerId
0        332  2024-12-30     Chicago           IL          24
1        386  2025-09-02      Tucson           AZ          27

In [47]:
#q21
sql = """
SELECT DISTINCT
  p.Name AS PlaylistName
FROM Playlist p
JOIN PlaylistTrack pt ON pt.PlaylistId = p.PlaylistId
JOIN Track t ON t.TrackId = pt.TrackId
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
WHERE ar.Name = 'Queen'
ORDER BY PlaylistName ASC;
"""
q21_df = pd.read_sql(sql, conn)
q21_df.to_pickle("q21.pkl")
q21_df.head()

  PlaylistName
0   90’s Music
1        Music

In [48]:
#q22
sql = """
SELECT DISTINCT
  e.EmployeeId, e.FirstName, e.LastName
FROM Employee e
JOIN Customer c ON c.SupportRepId = e.EmployeeId
JOIN Invoice i ON i.CustomerId = c.CustomerId
JOIN InvoiceLine il ON il.InvoiceId = i.InvoiceId
JOIN Track t ON t.TrackId = il.TrackId
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
WHERE ar.Name = 'Queen'
ORDER BY e.EmployeeId ASC;
"""
q22_df = pd.read_sql(sql, conn)
q22_df.to_pickle("q22.pkl")
q22_df.head()

   EmployeeId FirstName LastName
0           3      Jane  Peacock
1           4  Margaret     Park
2           5     Steve  Johnson

In [49]:
conn.execute(text("""
    ALTER TABLE Album MODIFY Title VARCHAR(255) COLLATE utf8mb4_general_ci;
"""))

conn.execute(text("""
    SET collation_connection = 'utf8mb4_general_ci';
"""))

In [50]:
#q23
sql = """
SELECT
  al.Title AS AlbumTitle,
  ar.Name AS ArtistName
FROM Album al
LEFT JOIN Artist ar ON ar.ArtistId = al.ArtistId
ORDER BY AlbumTitle ASC, ArtistName ASC;
"""
q23_df = pd.read_sql(sql, conn)
q23_df.to_pickle("q23.pkl")
q23_df.head()

,AlbumTitle,ArtistName
0,...And Justice For All,Metallica
1,20th Century Masters - The Millennium Collecti...,Scorpions
2,"A Copland Celebration, Vol. I",Aaron Copland & London Symphony Orchestra
3,A Matter of Life and Death,Iron Maiden
4,A Real Dead One,Iron Maiden

In [51]:
#q24
sql = """
SELECT
  al.Title AS AlbumTitle,
  ar.Name AS ArtistName
FROM Album al
RIGHT JOIN Artist ar ON ar.ArtistId = al.ArtistId
ORDER BY AlbumTitle ASC, ArtistName ASC;
"""
q24_df = pd.read_sql(sql, conn)
q24_df.to_pickle("q24.pkl")
q24_df.head()

  AlbumTitle                                         ArtistName
0       None                                       A Cor Do Som
1       None  Academy of St. Martin in the Fields, Sir Nevil...
2       None        Aerosmith & Sierra Leone's Refugee Allstars
3       None                                      Avril Lavigne
4       None                                            Azymuth

In [52]:
import os
missing = [i for i in range(15, 25) if not os.path.exists(f"q{i}.pkl")]
missing

[]

In [57]:
#q25
sql = """
SELECT
  GenreId,
  COUNT(*) AS TrackCount
FROM Track
GROUP BY GenreId
ORDER BY TrackCount DESC, GenreId ASC;
"""
q25_df = pd.read_sql(sql, conn)
q25_df.to_pickle("q25.pkl")
q25_df.head()

   GenreId  TrackCount
0        1        1297
1        7         579
2        3         374
3        4         332
4        2         130

In [58]:
#q26
sql = """
SELECT
  al.AlbumId,
  al.Title AS AlbumTitle,
  SUM(t.Milliseconds) / 3600000.0 AS TotalDurationHours
FROM Album al
JOIN Track t ON t.AlbumId = al.AlbumId
GROUP BY al.AlbumId, al.Title
ORDER BY TotalDurationHours DESC
LIMIT 5;
"""
q26_df = pd.read_sql(sql, conn)
q26_df.to_pickle("q26.pkl")
q26_df

   AlbumId                                AlbumTitle  TotalDurationHours
0      229                            Lost, Season 3             19.6293
1      253  Battlestar Galactica (Classic), Season 1             19.5038
2      230                            Lost, Season 1             18.0153
3      231                            Lost, Season 2             17.5805
4      228                          Heroes, Season 1             16.6056

In [59]:
#q27
sql = """
SELECT
  al.Title AS AlbumTitle,
  COUNT(DISTINCT t.GenreId) AS GenreCount
FROM Album al
JOIN Track t ON t.AlbumId = al.AlbumId
GROUP BY al.Title
HAVING COUNT(DISTINCT t.GenreId) > 1
ORDER BY GenreCount DESC, AlbumTitle ASC;
"""
q27_df = pd.read_sql(sql, conn)
q27_df.to_pickle("q27.pkl")
q27_df.head()

                       AlbumTitle  GenreCount
0  Battlestar Galactica, Season 3           3
1                   Greatest Hits           3
2                Heroes, Season 1           2
3                Live After Death           2
4                  Lost, Season 2           2

In [60]:
#q28
sql = """
SELECT
  ar.Name AS ArtistName,
  SUM(il.UnitPrice * il.Quantity) AS TotalRevenue
FROM Artist ar
JOIN Album al ON al.ArtistId = ar.ArtistId
JOIN Track t ON t.AlbumId = al.AlbumId
JOIN InvoiceLine il ON il.TrackId = t.TrackId
GROUP BY ar.Name
ORDER BY TotalRevenue DESC, ArtistName ASC;
"""
q28_df = pd.read_sql(sql, conn)
q28_df.to_pickle("q28.pkl")
q28_df.head()

     ArtistName  TotalRevenue
0   Iron Maiden        138.60
1            U2        105.93
2     Metallica         90.09
3  Led Zeppelin         86.13
4          Lost         81.59

In [61]:
#q29
sql = """
SELECT
  g.Name AS GenreName,
  AVG(t.Milliseconds / 60000.0) AS AverageDurationMinutes
FROM Genre g
JOIN Track t ON t.GenreId = g.GenreId
GROUP BY g.Name
HAVING AVG(t.Milliseconds / 60000.0) > 20
ORDER BY AverageDurationMinutes DESC;
"""
q29_df = pd.read_sql(sql, conn)
q29_df.to_pickle("q29.pkl")
q29_df

          GenreName  AverageDurationMinutes
0  Sci Fi & Fantasy               48.529723
1   Science Fiction               43.759169
2             Drama               42.921405
3          TV Shows               35.750689
4            Comedy               26.421076

In [62]:
#q30
sql = """
SELECT
  c.CustomerId,
  c.FirstName,
  c.LastName,
  SUM(il.UnitPrice * il.Quantity) AS TotalExpenditure,
  DENSE_RANK() OVER (ORDER BY SUM(il.UnitPrice * il.Quantity) DESC) AS ExpenditureRank
FROM Customer c
JOIN Invoice i ON i.CustomerId = c.CustomerId
JOIN InvoiceLine il ON il.InvoiceId = i.InvoiceId
JOIN Track t ON t.TrackId = il.TrackId
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
WHERE ar.Name = 'Queen'
GROUP BY c.CustomerId, c.FirstName, c.LastName
ORDER BY TotalExpenditure DESC, c.CustomerId ASC;
"""
q30_df = pd.read_sql(sql, conn)
q30_df.to_pickle("q30.pkl")
q30_df.head()

   CustomerId  FirstName  LastName  TotalExpenditure  ExpenditureRank
0          24      Frank   Ralston              3.96                1
1          29     Robert     Brown              3.96                1
2          33      Ellie  Sullivan              3.96                1
3          40  Dominique  Lefebvre              3.96                1
4          50    Enrique     Muñoz              3.96                1

In [63]:
#q30
sql = """
SELECT
  c.CustomerId,
  c.FirstName,
  c.LastName,
  SUM(il.UnitPrice * il.Quantity) AS TotalExpenditure,
  DENSE_RANK() OVER (ORDER BY SUM(il.UnitPrice * il.Quantity) DESC) AS ExpenditureRank
FROM Customer c
JOIN Invoice i ON i.CustomerId = c.CustomerId
JOIN InvoiceLine il ON il.InvoiceId = i.InvoiceId
JOIN Track t ON t.TrackId = il.TrackId
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
WHERE ar.Name = 'Queen'
GROUP BY c.CustomerId, c.FirstName, c.LastName
ORDER BY TotalExpenditure DESC, c.CustomerId ASC;
"""
q30_df = pd.read_sql(sql, conn)
q30_df.to_pickle("q30.pkl")
q30_df.head()

   CustomerId  FirstName  LastName  TotalExpenditure  ExpenditureRank
0          24      Frank   Ralston              3.96                1
1          29     Robert     Brown              3.96                1
2          33      Ellie  Sullivan              3.96                1
3          40  Dominique  Lefebvre              3.96                1
4          50    Enrique     Muñoz              3.96                1

In [64]:
#q31
sql = """
SELECT
  TrackId,
  Name AS TrackName,
  (Milliseconds / 60000.0) AS DurationMinutes,
  RANK() OVER (ORDER BY Milliseconds DESC) AS DurationRank
FROM Track
ORDER BY DurationRank ASC, DurationMinutes DESC, TrackId ASC;
"""
q31_df = pd.read_sql(sql, conn)
q31_df.to_pickle("q31.pkl")
q31_df.head()

   TrackId                    TrackName  DurationMinutes  DurationRank
0     2820       Occupation / Precipice          88.1159             1
1     3224      Through a Looking Glass          84.8140             2
2     3244  Greetings from Earth, Pt. 1          49.3382             3
3     3242      The Man With Nine Lives          49.2833             4
4     3227  Battlestar Galactica, Pt. 2          49.2680             5

In [65]:
#q32
sql = """
SELECT
  c.CustomerId,
  c.FirstName,
  c.LastName,
  SUM(il.UnitPrice * il.Quantity) AS TotalExpenditure,
  DENSE_RANK() OVER (ORDER BY SUM(il.UnitPrice * il.Quantity) DESC) AS ExpenditureRank
FROM Customer c
JOIN Invoice i ON i.CustomerId = c.CustomerId
JOIN InvoiceLine il ON il.InvoiceId = i.InvoiceId
JOIN Track t ON t.TrackId = il.TrackId
JOIN Album al ON al.AlbumId = t.AlbumId
JOIN Artist ar ON ar.ArtistId = al.ArtistId
WHERE ar.Name = 'Queen'
GROUP BY c.CustomerId, c.FirstName, c.LastName
ORDER BY TotalExpenditure DESC, c.CustomerId ASC;
"""
q32_df = pd.read_sql(sql, conn)
q32_df.to_pickle("q32.pkl")
q32_df.head()

   CustomerId  FirstName  LastName  TotalExpenditure  ExpenditureRank
0          24      Frank   Ralston              3.96                1
1          29     Robert     Brown              3.96                1
2          33      Ellie  Sullivan              3.96                1
3          40  Dominique  Lefebvre              3.96                1
4          50    Enrique     Muñoz              3.96                1

In [66]:
#q33
sql = """
SELECT
  c.CustomerId,
  c.FirstName,
  c.LastName,
  COUNT(i.InvoiceId) AS InvoicesCount,
  ROW_NUMBER() OVER (ORDER BY COUNT(i.InvoiceId) DESC, c.LastName ASC) AS InvoiceRank
FROM Customer c
LEFT JOIN Invoice i ON i.CustomerId = c.CustomerId
GROUP BY c.CustomerId, c.FirstName, c.LastName
ORDER BY InvoiceRank ASC;
"""
q33_df = pd.read_sql(sql, conn)
q33_df.to_pickle("q33.pkl")
q33_df.head()

   CustomerId FirstName LastName  InvoicesCount  InvoiceRank
0          12   Roberto  Almeida              7            1
1          28     Julia  Barnett              7            2
2          39   Camille  Bernard              7            3
3          18  Michelle   Brooks              7            4
4          29    Robert    Brown              7            5

In [67]:
#q34
sql = """
SELECT BillingCountry, InvoiceId, Total, InvoiceRank
FROM (
  SELECT
    BillingCountry,
    InvoiceId,
    Total,
    DENSE_RANK() OVER (PARTITION BY BillingCountry ORDER BY Total DESC) AS InvoiceRank
  FROM Invoice
) x
WHERE InvoiceRank <= 3
ORDER BY BillingCountry ASC, Total DESC, InvoiceId ASC;
"""
q34_df = pd.read_sql(sql, conn)
q34_df.to_pickle("q34.pkl")
q34_df.head(10)

  BillingCountry  InvoiceId  Total  InvoiceRank
0      Argentina        348  13.86            1
1      Argentina        403   8.91            2
2      Argentina        164   5.94            3
3      Australia        250  13.86            1
4      Australia        305   8.91            2
5      Australia         66   5.94            3
6        Austria         89  18.86            1
7        Austria        144   8.91            2
8        Austria        318   5.94            3
9        Belgium        187  13.86            1

In [68]:
#q35
sql = """
SELECT
  Month,
  MonthlySales,
  AVG(MonthlySales) OVER (
    ORDER BY Month
    ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
  ) AS MovingAverageSales
FROM (
  SELECT
    DATE_FORMAT(InvoiceDate, '%Y-%m') AS Month,
    SUM(Total) AS MonthlySales
  FROM Invoice
  GROUP BY DATE_FORMAT(InvoiceDate, '%Y-%m')
) m
ORDER BY Month ASC;
"""
q35_df = pd.read_sql(sql, conn)
q35_df.to_pickle("q35.pkl")
q35_df.head(12)

      Month  MonthlySales  MovingAverageSales
0   2021-01         35.64               35.64
1   2021-02         37.62               36.63
2   2021-03         37.62               36.96
3   2021-04         37.62               37.62
4   2021-05         37.62               37.62
5   2021-06         37.62               37.62
6   2021-07         37.62               37.62
7   2021-08         37.62               37.62
8   2021-09         37.62               37.62
9   2021-10         37.62               37.62
10  2021-11         37.62               37.62
11  2021-12         37.62               37.62